Mallas/M2.75/constant/polyMesh/boundary
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class polyBoundaryMesh;
 location "constant/polyMesh";
 object boundary;
}

(
  FrontAndBack

  {
    type empty;
    physicalType patch;
    nFaces 89224;
    startFace 73779;

  }
  patch1

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 163003;

  }
  patch2

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 163101;

  }
  patch3

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 163199;

  }
  Shaft

  {
    type wall;
    physicalType patch;
    nFaces 18;
    startFace 163297;

  }
  Inlet

  {
    type patch;
    physicalType patch;
    nFaces 49;
    startFace 163315;

  }
  Lat-Wall

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 163364;

  }
  Outlet

  {
    type patch;
    physicalType patch;
    nFaces 49;
    startFace 163462;

  }
  AMI-St

  {
    type cyclicAMI;
neighbourPatch AMI-Rt;
 matchTolerance 1e-4; 
 transform noOrdering;
    physicalType patch;
    nFaces 169;
    startFace 163511;

  }
  AMI-Rt

  {
    type cyclicAMI;
neighbourPatch AMI-St;
 matchTolerance 1e-4; 
 transform noOrdering;
    physicalType patch;
    nFaces 169;
    startFace 163680;

  }
)


// ************************************************************************* //