Mallas/M2.75/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.06;

boundaryField
{
    FrontAndBack
    {
        type            empty;
    }
    patch1
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    patch2
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    patch3
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    Shaft
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    Inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    Lat-Wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    Outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    AMI-Rt
    {
        type            cyclicAMI;
        value           $internalField;
    }
    AMI-St
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //
