Mallas/M2.75/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    FrontAndBack
    {
        type            empty;
    }
    patch1
    {
        type            calculated;
        value           nonuniform List<scalar> 
98
(
0.979967
0.973555
0.973736
0.98146
0.996639
1.01745
1.0346
1.04487
...
)
;
    }
    patch2
    {
        type            calculated;
        value           nonuniform List<scalar> 
98
(
0.98032
0.975049
0.974725
0.981769
0.999156
1.01698
1.0309
1.04245
...
)
;
    }
    patch3
    {
        type            calculated;
        value           nonuniform List<scalar> 
98
(
0.983963
0.976798
0.972003
0.983974
1.00186
1.01828
1.03284
1.04164
...
)
;
    }
    Shaft
    {
        type            calculated;
        value           nonuniform List<scalar> 
18
(
12.2052
12.1534
12.1161
12.0936
12.0861
12.0936
12.1161
12.1534
12.2052
12.2052
12.1534
12.1161
12.0936
12.0861
12.0936
12.1161
12.1534
12.2052
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform 0;
    }
    Lat-Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
98
(
973.092
722.429
1020.72
943.352
996.124
823.857
953.37
936.957
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           uniform 0;
    }
    AMI-St
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI-Rt
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
